Pratice/CurlRef/formated-req.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Factorial xmlns="http://tempuri.org/">
      <n>5</n>
    </Factorial>
  </soap:Body>
</soap:Envelope>
