Pratice/CurlRef/request-response-sample.txt

POST /SSIT.asmx HTTP/1.1
Host: grasshoppernetwork.com
Content-Type: text/xml; charset=utf-8
Content-Length: length
SOAPAction: "http://tempuri.org/Factorial"

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<Factorial xmlns="http://tempuri.org/">
<n>int</n>
</Factorial>
</soap:Body>
</soap:Envelope>
